#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
    
   ЮТТесты.ДобавитьТестовыйНабор("Общий модуль API_ОписанияТоваров. ПолучитьТоварПоАртикулу()").ВТранзакции()
		.ДобавитьТест("ПолучитьТоварПоАртикулу_ПолучениеТовараБезГенерации", "", "Позитив")
		.ДобавитьТест("ПолучитьТоварПоАртикулу_ТоварНеНайденПоАртикулу", "", "Негатив")
		.ДобавитьТест("ПолучитьТоварПоАртикулу_ПолучениеТовараСГенерацией", "", "Позитив")  
	;

КонецПроцедуры

Процедура ПолучитьТоварПоАртикулу_ПолучениеТовараБезГенерации() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции.
	Артикул = "Bos0009";
	
	// 2. Выполнение функции.
    Товар = API_ОписанияТоваров.ПолучитьТоварПоАртикулу(Артикул);
	
	// 3. Проверка результата.
	ЮТест.ОжидаетЧто(Товар)
		.ИмеетТип("СправочникОбъект.Товары")
		.Свойство("Артикул").Равно(Артикул)
		.Свойство("Наименование").Равно("Босоножки")
		;
		
КонецПроцедуры 

Процедура ПолучитьТоварПоАртикулу_ТоварНеНайденПоАртикулу() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции.
	Артикул = "1111122222223333333333333333";
	
	// 2. Выполнение функции.
    Товар = API_ОписанияТоваров.ПолучитьТоварПоАртикулу(Артикул);
	
	// 3. Проверка результата.
	ЮТест.ОжидаетЧто(Товар)
		.ИмеетТип("Неопределено")
		;
		
КонецПроцедуры 

Процедура ПолучитьТоварПоАртикулу_ПолучениеТовараСГенерацией() Экспорт

	// 1. Подготовка параметров и генерация данных для выполнения функции.
	// Описание программного создания: https://bia-technologies.github.io/yaxunit/docs/features/test-data/data-generation/
	
	Артикул = "Test1234";
	Наименование = "Test_Хлеб";
	
	// Создание товара
	НовыйТовар = ЮТест.Данные().КонструкторОбъекта("Справочники.Товары")
		.ФикцияОбязательныхПолей()
		.Установить("Артикул", Артикул) // проверочный артикул
		.Установить("Наименование", Наименование) // проверочное наименование
		.ФикцияРеквизитов("Поставщик, Вид, Штрихкод, Описание")
		.Записать()
		;
			
	// 2. Выполнение функции.
    Товар = API_ОписанияТоваров.ПолучитьТоварПоАртикулу(Артикул);
	
	// 3. Проверка результата.
	ЮТест.ОжидаетЧто(Товар)
		.ИмеетТип("СправочникОбъект.Товары")
		.Свойство("Артикул").Равно(Артикул)
		.Свойство("Наименование").Равно(Наименование)
		;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти