#Область ПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
    
	ЮТТесты
		.ДобавитьТест("Тест_СложениеБезПараметров")
		.ДобавитьТест("СложениеСПараметрами")
		    .СПараметрами(2, 3, 5)
		    .СПараметрами(2, -3, -1)
		    .СПараметрами("2", "-3", "2-3")
		    .СПараметрами("2", -3, "2-3")
		;

КонецПроцедуры

Процедура Тест_СложениеБезПараметров() Экспорт
	
	// 1 Подготовка и генерация данных
	
	// 2 Вызов функции
	РезультатСложения = 2 + 2; 
	
	// 3 Проверка утверждений
	ЮТест.ОжидаетЧто(РезультатСложения)
		.ИмеетТип("Число")
		.Равно(4)		
		; 

КонецПроцедуры

Процедура СложениеСПараметрами(ПервыйОперанд, ВторойОперанд, Результат) Экспорт
	
	РезультатСложения = ПервыйОперанд + ВторойОперанд;
	
	ЮТест.ОжидаетЧто(РезультатСложения)
    	.Равно(Результат);
		
КонецПроцедуры

#КонецОбласти
